# Задача 12: Петя и Катя – брат и сестра.
# Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.
#
# Пример
# Ввод: 5 6 -> Вывод: 2 3

summ = int(input("Введите сумму: "))
prod = int(input("Введите произведение: "))
for x in range(1, 1001):
    y = summ - x
    if x * y == prod:
        print(f"{x} {y}")
        break